kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxd/PIC32MX270F256D.svd
        <register>
          <name>IEC0CLR</name>
          <description>IEC0CLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0SET</name>
          <description>IEC0SET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0INV</name>
          <description>IEC0INV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1</name>
          <description>IEC1 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CTMUIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1CLR</name>
          <description>IEC1CLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PMPIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CTMUIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
