kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxd/PIC32MX270F256D.svd
        <register>
          <name>IPC8</name>
          <description>IPC8 register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8CLR</name>
          <description>IPC8CLR register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8SET</name>
          <description>IPC8SET register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8INV</name>
          <description>IPC8INV register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9</name>
          <description>IPC9 register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9CLR</name>
          <description>IPC9CLR register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9SET</name>
          <description>IPC9SET register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9INV</name>
          <description>IPC9INV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10</name>
          <description>IPC10 register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10CLR</name>
          <description>IPC10CLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10SET</name>
          <description>IPC10SET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10INV</name>
          <description>IPC10INV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
