kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxd/PIC32MX270F256D.svd
        <register>
          <name>U1CNFG1</name>
          <description>U1CNFG1 register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UASUSPND</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CNFG1CLR</name>
          <description>U1CNFG1CLR register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UASUSPND</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CNFG1SET</name>
          <description>U1CNFG1SET register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UASUSPND</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CNFG1INV</name>
          <description>U1CNFG1INV register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UASUSPND</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USBSIDL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBFRZ</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UOEMON</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UTEYE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0</name>
          <description>U1EP0 register</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0CLR</name>
          <description>U1EP0CLR register</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0SET</name>
          <description>U1EP0SET register</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP0INV</name>
          <description>U1EP0INV register</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RETRYDIS</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSPD</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1</name>
          <description>U1EP1 register</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1CLR</name>
          <description>U1EP1CLR register</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1SET</name>
          <description>U1EP1SET register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP1INV</name>
          <description>U1EP1INV register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2</name>
          <description>U1EP2 register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2CLR</name>
          <description>U1EP2CLR register</description>
          <addressOffset>0x2e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2SET</name>
          <description>U1EP2SET register</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP2INV</name>
          <description>U1EP2INV register</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3</name>
          <description>U1EP3 register</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3CLR</name>
          <description>U1EP3CLR register</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3SET</name>
          <description>U1EP3SET register</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP3INV</name>
          <description>U1EP3INV register</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP4</name>
          <description>U1EP4 register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP4CLR</name>
          <description>U1EP4CLR register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP4SET</name>
          <description>U1EP4SET register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP4INV</name>
          <description>U1EP4INV register</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP5</name>
          <description>U1EP5 register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP5CLR</name>
          <description>U1EP5CLR register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
