kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxd/PIC32MX270F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTC</name>
      <description>PORTC peripheral</description>
      <baseAddress>0xbf886200</baseAddress>
      <registers>
        <register>
          <name>ANSELC</name>
          <description>ANSELC register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>ANSC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELCCLR</name>
          <description>ANSELCCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELCSET</name>
          <description>ANSELCSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELCINV</name>
          <description>ANSELCINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISC</name>
          <description>TRISC register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>1023</resetValue>
          <fields>
            <field>
              <name>TRISC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISCCLR</name>
          <description>TRISCCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISCSET</name>
          <description>TRISCSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISCINV</name>
          <description>TRISCINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTC</name>
          <description>PORTC register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTCCLR</name>
          <description>PORTCCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTCSET</name>
          <description>PORTCSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTCINV</name>
          <description>PORTCINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATC</name>
          <description>LATC register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCCLR</name>
          <description>LATCCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCSET</name>
          <description>LATCSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCINV</name>
          <description>LATCINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCC</name>
          <description>ODCC register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCCCLR</name>
          <description>ODCCCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
