kiffie/pic32-pac/pic32mx2xx/pic32mx2xxfxxxd/PIC32MX270F256D.svd
        <register>
          <name>CNSTATCCLR</name>
          <description>CNSTATCCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCSET</name>
          <description>CNSTATCSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCINV</name>
          <description>CNSTATCINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>